import { LoveNote } from './types';

// ==========================================
// Фотографии для падающих сердечек
// ==========================================

export const USER_PHOTOS = [
  "https://i.ibb.co/20ffS2qT/68ce34e9-9497-456f-a643-9a04daf4aca7.jpg",
  "https://i.ibb.co/jvy36Dd8/0f72c472-a36b-47f0-ba75-82f77cc7f364.jpg",
  "https://i.ibb.co/8Dk61pcg/ea486ae4-505c-4c15-8c7f-38d42d46d0cc.jpg",
  "https://i.ibb.co/d41P2XDs/eaa18fb9-7676-4afd-ab18-f6a7fc377102.png",
  "https://i.ibb.co/rKyP73p9/0650f403-b532-41dc-8d56-c79b5bb26122.png",
  "https://i.ibb.co/3m9Ppkzt/80cb3dee-38a1-468b-8c80-720031738eae.jpg",
  "https://i.ibb.co/PG6xrZPC/1a83b9d8-3110-466b-afa8-f5f5116e5f86.jpg"
];

export const INITIAL_NOTES: LoveNote[] = [
  {
    id: '1',
    title: 'Ты особенная!',
    content: "Каждое мгновение с тобой похоже на прекрасный сон, от которого я никогда не хочу просыпаться.",
    emoji: '💖',
    isOpen: false,
  },
  {
    id: '2',
    title: 'Что я люблю в тебе',
    content: "Я обожаю, когда ты улыбаешься.",
    emoji: '✨',
    isOpen: false,
  },
  {
    id: '3',
    title: 'Для тебя',
    content: "Я не могу оторвать взгляд от твоей улыбки.",
    emoji: '💐',
    isOpen: false,
  },
  {
    id: '4',
    title: 'С Днем Святого Валентина',
    content: "Я с нетерпением жду каждого нового дня с тобой.",
    emoji: '🌹',
    isOpen: false,
  },
];
